@sjahl here's the output of the `terraform plan`
```
google_pubsub_topic_iam_member.mondo_function: Refreshing state... [id=projects/clingen-dx/topics/mondo-release-notifications/roles/pubsub.publisher/serviceAccount:clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com]
google_project_iam_member.confluent_dev_binding: Refreshing state... [id=clingen-dx/roles/pubsub.subscriber/serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com]
google_service_account.confluent_cloud_pubsub_subscriber: Refreshing state... [id=projects/clingen-dx/serviceAccounts/clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com]
google_project_iam_member.confluent_dev_viewer_binding: Refreshing state... [id=clingen-dx/roles/pubsub.viewer/serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com]
google_pubsub_topic.mondo_notifications: Refreshing state... [id=projects/clingen-dx/topics/mondo-release-notifications]
google_service_account.mondo_notifier_func: Refreshing state... [id=projects/clingen-dx/serviceAccounts/clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com]
google_pubsub_subscription.kafka_source_subscription: Refreshing state... [id=projects/clingen-dx/subscriptions/confluent-dev-cluster-source-subscription]
google_cloudbuild_trigger.mondo_notifier_repo: Refreshing state... [id=projects/clingen-dx/triggers/4eca18e8-583b-4433-aad9-46b38ea58792]
google_service_account_iam_member.cloudbuild_mondo_notifier_binding: Refreshing state... [id=projects/clingen-dx/serviceAccounts/clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:974091131481@cloudbuild.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # google_project_iam_member.confluent_dev_binding has been deleted
  - resource "google_project_iam_member" "confluent_dev_binding" {
      - etag    = "BwXSu2hs28c=" -> null
      - id      = "clingen-dx/roles/pubsub.subscriber/serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - project = "clingen-dx" -> null
      - role    = "roles/pubsub.subscriber" -> null
    }

  # google_project_iam_member.confluent_dev_viewer_binding has been deleted
  - resource "google_project_iam_member" "confluent_dev_viewer_binding" {
      - etag    = "BwXSu2hs28c=" -> null
      - id      = "clingen-dx/roles/pubsub.viewer/serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - project = "clingen-dx" -> null
      - role    = "roles/pubsub.viewer" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond
to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_pubsub_subscription.kafka_source_subscription will be destroyed
  # (because google_pubsub_subscription.kafka_source_subscription is not in configuration)
  - resource "google_pubsub_subscription" "kafka_source_subscription" {
      - ack_deadline_seconds       = 20 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/clingen-dx/subscriptions/confluent-dev-cluster-source-subscription" -> null
      - labels                     = {} -> null
      - message_retention_duration = "1200s" -> null
      - name                       = "confluent-dev-cluster-source-subscription" -> null
      - project                    = "clingen-dx" -> null
      - retain_acked_messages      = true -> null
      - topic                      = "projects/clingen-dx/topics/mondo-release-notifications" -> null

      - expiration_policy {
          - ttl = "300000.500s" -> null
        }

      - retry_policy {
          - maximum_backoff = "600s" -> null
          - minimum_backoff = "10s" -> null
        }
    }

  # google_pubsub_topic.mondo_notifications will be destroyed
  # (because google_pubsub_topic.mondo_notifications is not in configuration)
  - resource "google_pubsub_topic" "mondo_notifications" {
      - id      = "projects/clingen-dx/topics/mondo-release-notifications" -> null
      - labels  = {
          - "managed_by"   = "terraform"
          - "owner"        = "sjahl"
          - "pubsub_topic" = "mondo-release-notifications"
        } -> null
      - name    = "mondo-release-notifications" -> null
      - project = "clingen-dx" -> null
    }

  # google_pubsub_topic_iam_member.mondo_function will be destroyed
  # (because google_pubsub_topic_iam_member.mondo_function is not in configuration)
  - resource "google_pubsub_topic_iam_member" "mondo_function" {
      - etag    = "BwXPVri/g1k=" -> null
      - id      = "projects/clingen-dx/topics/mondo-release-notifications/roles/pubsub.publisher/serviceAccount:clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com" -> null
      - project = "clingen-dx" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/clingen-dx/topics/mondo-release-notifications" -> null
    }

  # google_secret_manager_secret_iam_member.kafka_creds_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "kafka_creds_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "kafka_credentials"
    }

  # google_secret_manager_secret_iam_member.mondo_git_webhook_secret_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "mondo_git_webhook_secret_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "clingen-mondo-notify@clingen-dx.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "mondo-git-webhook_secret"
    }

  # google_service_account.confluent_cloud_pubsub_subscriber will be destroyed
  # (because google_service_account.confluent_cloud_pubsub_subscriber is not in configuration)
  - resource "google_service_account" "confluent_cloud_pubsub_subscriber" {
      - account_id   = "clingen-dev-mondo-subscriber" -> null
      - disabled     = false -> null
      - display_name = "Subscriber account for consuming mondo update notifications" -> null
      - email        = "clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - id           = "projects/clingen-dx/serviceAccounts/clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - name         = "projects/clingen-dx/serviceAccounts/clingen-dev-mondo-subscriber@clingen-dx.iam.gserviceaccount.com" -> null
      - project      = "clingen-dx" -> null
      - unique_id    = "106537146050116728715" -> null
    }

Plan: 2 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```